//Завдання 5
//Користувач може оформити доставку товару до себе в країну, вказавши її при
//відвідуванні сторінки в prompt. Врахуй, користувач може ввести ім'я країни не
//тільки буквами нижнього реєстру, а й на приклад 'кИтАЙ'.
//Напишіть скрипт, який виводить повідомлення про вартість доставки у вказану
//країну. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна]
//кредитів.
//Якщо зазначеної країни немає в списку, то виводи в alert повідомлення 'В вашій
//країні доставка не доступна'.
//Нижче наведено список країн і вартість доставки.
//Китай - 100 кредитів Чилі - 250 кредитів Австралія - 170 кредитів Індія – 80
//кредитів Ямайка - 120 кредитів

let country = prompt('Ввудіть країну для доставки:');
if(country !== null){
    const formattedCountry = country.toLocaleLowerCase();
    let price;
    switch(formattedCountry){
        case 'китай':
            price = 100;
            break;
        case 'чилі':
            price = 250;
            break;
        case 'австралія':
            price = 170;
            break;
        case 'індія':
            price = 80;
            break;
        case 'ямайка':
            price = 120;
            break;
        default:
            alert('В вашій країні доставка не доступна');
            break;
    }
    if (price !== undefined){
        alert(`Доставка в ${country} буде коштувати ${price} кредитів`)
    }
} else {
    alert('Такої країни не існує. Операцію скасовано');
}