//Завдання 4 На рахунку користувача є 23580 кредитів, значення яких зберігається в
//змінній credits (створи зміну та присвой). Користувач вирішує купити телевізори,
//які коштують по 3000 кредитів за штуку. Ціна одного телевізора зберігається в
//змінній pricePerDroid (створи та присвой).
//При відвідуванні сторінки, використовуючи prompt, необхідно запитати кількість
//телевізорів, які користувач хоче купити і зберегти в змінну.
//Напишіть скрипт, який:
//Якщо в prompt була натиснута кнопка Cancel, виведе повідомлення в консоль
//«Операцію скасовано!» У протилежному випадку розраховує загальну ціну замовлення
//та зберігає в змінній totalPrice. Перевіряє, чи зможе користувач оплатити
//замовлення: якщо сума до оплати перевищує кількість кредитів на рахунок, виводе
//в консоль повідомлення 'Недостатньо коштів на рахунку!'. в іншому випадку
//Необхідно підрахувати залишок кредитів на рахунку та вивести повідомлення «Ви
//купили [кількість] телевізорів, на рахунку залишилось [число] кредитів.'.

let credits = 23580;
const pricePerDroid = 3000;
let quantityToBuy = prompt('Яку кількість телевізорів бажаєте придбати?');
if (quantityToBuy === null || quantityToBuy.trim() === ""){
    alert('Операцію скасовано!');
} else {
    const quantity = Number(quantityToBuy);
    if (!isNaN(quantity) && quantity > 0){
        const totalPrice = pricePerDroid * quantity;
        if (totalPrice > credits){
            alert('Недостатньо коштів на рахунку!');
        } else {
            credits -= totalPrice;
            alert(`Ви купили ${quantity} телевізорів, на рахунку залишилось ${credits} кредитів.`)
        }
    } else {
        alert('Введіть правильне число')
    }
}